# Data Types

## Prepare and clean data

In [ ]:
import pandas as pd

In [96]:
treatment = {'name':['Daniel','John','Jane'],
             'sex':['male','male','female'],
             'treatment a':['','12','24'],
             'treatment b':[42,31,27]}
treatment

{'name': ['Daniel', 'John', 'Jane'],
 'sex': ['male', 'male', 'female'],
 'treatment a': ['', '12', '24'],
 'treatment b': [42, 31, 27]}

In [97]:
df_treatment = pd.DataFrame(treatment)

In [98]:
df_treatment

     name     sex treatment a  treatment b
0  Daniel    male                       42
1    John    male          12           31
2    Jane  female          24           27

In [18]:
df_treatment.dtypes

name           object
sex            object
treatment a    object
treatment b     int64
dtype: object

In [19]:
# mengubah type data
# numerical to object str
# categorical as category

In [41]:
df_treatment['treatment b'] = df_treatment['treatment b'].astype(str)

In [42]:
df_treatment['sex'] = df_treatment['sex'].astype('category')

In [43]:
df_treatment.dtypes

name             object
sex            category
treatment a      object
treatment b      object
dtype: object

## Cleaning bad data

In [44]:
df_treatment['treatment a'] = pd.to_numeric(df_treatment['treatment a'],
                                           errors='coerge')

In [46]:
df_treatment['treatment b'] = pd.to_numeric(df_treatment['treatment b'],
                                           errors='coerge')

In [47]:
df_treatment.dtypes

name             object
sex            category
treatment a     float64
treatment b       int64
dtype: object

# Let's Practice!
## Using Regular Expression to clean strings

In [31]:
import re

In [32]:
pattern = re.compile('\$\d*\.\d{2}')

In [33]:
result = pattern.match('$17.89')

In [34]:
bool(result)

True

## Using functions to clean data

Cleaning
1. Extract number from string
2. Perform transformation on extracted number

Python Function

In [53]:
data = {'name':['Daniel','John','Jane'],
             'treatment a':[18,12,24],
             'treatment b':[42,31,27]}
data

{'name': ['Daniel', 'John', 'Jane'],
 'treatment a': [18, 12, 24],
 'treatment b': [42, 31, 27]}

In [59]:
df = pd.DataFrame(data)
df.index = df['name']
del df['name']
df

        treatment a  treatment b
name
Daniel           18           42
John             12           31
Jane             24           27

In [60]:
import numpy as np

df.apply(np.mean, axis=0)

treatment a    18.000000
treatment b    33.333333
dtype: float64

In [61]:
df.apply(np.mean, axis=1)

name
Daniel    30.0
John      21.5
Jane      25.5
dtype: float64

### Applying function

In [71]:
df_job = pd.read_csv('dob_job_application_filings_subset.csv')
df_job.head()

/home/cade/anaconda3/lib/python3.6/site-packages/IPython/core/interactiveshell.py:2698: DtypeWarning: Columns (16) have mixed types. Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

,Job #,Doc #,Borough,House #,Street Name,Block,Lot,Bin #,Job Type,Job Status,...,Owner's Last Name,Owner's Business Name,Owner's House Number,Owner'sHouse Street Name,City,State,Zip,Owner'sPhone #,Job Description,DOBRunDate
0,121577873,2,MANHATTAN,386,PARK AVENUE SOUTH,857,38,1016890,A2,D,...,MIGLIORE,MACKLOWE MANAGEMENT,126,EAST 56TH STREET,NEW YORK,NY,10222,2125545837,GENERAL MECHANICAL & PLUMBING MODIFICATIONS AS...,04/26/2013 12:00:00 AM
1,520129502,1,STATEN ISLAND,107,KNOX PLACE,342,1,5161350,A3,A,...,BLUMENBERG,NA,107,KNOX PLACE,STATEN ISLAND,NY,10314,3477398892,BUILDERS PAVEMENT PLAN 143 LF. ...,04/26/2013 12:00:00 AM
2,121601560,1,MANHATTAN,63,WEST 131 STREET,1729,9,1053831,A2,Q,...,MARKOWITZ,635 RIVERSIDE DRIVE NY LLC,619,WEST 54TH STREET,NEW YORK,NY,10016,2127652555,GENERAL CONSTRUCTION TO INCLUDE NEW PARTITIONS...,04/26/2013 12:00:00 AM
3,121601203,1,MANHATTAN,48,WEST 25TH STREET,826,69,1015610,A2,D,...,CASALE,48 W 25 ST LLC C/O BERNSTEIN,150,WEST 30TH STREET,NEW YORK,NY,10001,2125941414,STRUCTURAL CHANGES ON THE 5TH FLOOR (MOONDOG E...,04/26/2013 12:00:00 AM
4,121601338,1,MANHATTAN,45,WEST 29 STREET,831,7,1015754,A3,D,...,LEE,HYUNG-HYANG REALTY CORP,614,8 AVENUE,NEW YORK,NY,10001,2019881222,FILING HEREWITH FACADE REPAIR PLANS. WORK SCOP...,04/26/2013 12:00:00 AM

In [80]:
df_job2 =df_job.iloc[0:5,0:3]
df_job2

       Job #  Doc #        Borough
0  121577873      2      MANHATTAN
1  520129502      1  STATEN ISLAND
2  121601560      1      MANHATTAN
3  121601203      1      MANHATTAN
4  121601338      1      MANHATTAN

In [73]:
money = {'Initial Cost':['$75000.00', '$0.00', 
                         '$30000.00', '$1500.00', 
                         '$19500.00'],
         'Total Est. Fee':['$986.00', '$1144.00', 
                           '$522.50', '$225.00', 
                           '$389.50']}

In [75]:
df_money = pd.DataFrame(money)
df_money

  Initial Cost Total Est. Fee
0    $75000.00        $986.00
1        $0.00       $1144.00
2    $30000.00        $522.50
3     $1500.00        $225.00
4    $19500.00        $389.50

In [85]:
df_jobb = pd.concat([df_job2, df_money], axis=1)

In [86]:
df_jobb

       Job #  Doc #        Borough Initial Cost Total Est. Fee
0  121577873      2      MANHATTAN    $75000.00        $986.00
1  520129502      1  STATEN ISLAND        $0.00       $1144.00
2  121601560      1      MANHATTAN    $30000.00        $522.50
3  121601203      1      MANHATTAN     $1500.00        $225.00
4  121601338      1      MANHATTAN    $19500.00        $389.50

In [87]:
import re

In [89]:
from numpy import NaN

In [90]:
#regex
pattern = re.compile('^\$\d*\.\d{2}$')

In [92]:
#write a function
def diff_money(row, pattern):
    icost = row['Initial Cost']
    tef = row['Total Est. Fee']
    
    if bool(pattern.match(icost)) and bool(pattern.match(tef)):
        icost = icost.replace("$", "")
        tef = tef.replace("$","")
        
        icost = float(icost)
        tef = float(tef)
        
        return icost-tef
    
    else:
        return(NaN)

In [93]:
df_jobb['diff'] = df_jobb.apply(diff_money, axis=1, pattern=pattern)

In [94]:
df_jobb

       Job #  Doc #        Borough Initial Cost Total Est. Fee     diff
0  121577873      2      MANHATTAN    $75000.00        $986.00  74014.0
1  520129502      1  STATEN ISLAND        $0.00       $1144.00  -1144.0
2  121601560      1      MANHATTAN    $30000.00        $522.50  29477.5
3  121601203      1      MANHATTAN     $1500.00        $225.00   1275.0
4  121601338      1      MANHATTAN    $19500.00        $389.50  19110.5

## Duplicate and Missing Data

### Drop Duplicates

In [100]:
treat = {'name':['Daniel','John','Jane','Daniel'],
             'sex':['male','male','female','male'],
             'treatment a':['','12','24',''],
             'treatment b':[42,31,27,42]}
treat

{'name': ['Daniel', 'John', 'Jane', 'Daniel'],
 'sex': ['male', 'male', 'female', 'male'],
 'treatment a': ['', '12', '24', ''],
 'treatment b': [42, 31, 27, 42]}

In [101]:
df_treat = pd.DataFrame(treat)
df_treat

     name     sex treatment a  treatment b
0  Daniel    male                       42
1    John    male          12           31
2    Jane  female          24           27
3  Daniel    male                       42

In [103]:
df_treat = df_treat.drop_duplicates()
df_treat

     name     sex treatment a  treatment b
0  Daniel    male                       42
1    John    male          12           31
2    Jane  female          24           27

## Missing Data

In [127]:
df_tipmiss = pd.read_csv('tips_missing.csv')
df_tipmiss

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1         NaN  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68   NaN    Male     No  Sun  Dinner     2
4       24.59  3.61     NaN    NaN  Sun     NaN     4

In [105]:
df_tipmiss.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 7 columns):
total_bill    4 non-null float64
tip           4 non-null float64
sex           4 non-null object
smoker        4 non-null object
day           5 non-null object
time          4 non-null object
size          5 non-null int64
dtypes: float64(2), int64(1), object(4)
memory usage: 360.0+ bytes

#### Menghapus data yang ada missing value nya

In [113]:
df_tipdropped = df_tipmiss.dropna()

In [114]:
df_tipdropped

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
2       21.01  3.50    Male     No  Sun  Dinner     3

In [115]:
df_tipdropped.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2 entries, 0 to 2
Data columns (total 7 columns):
total_bill    2 non-null float64
tip           2 non-null float64
sex           2 non-null object
smoker        2 non-null object
day           2 non-null object
time          2 non-null object
size          2 non-null int64
dtypes: float64(2), int64(1), object(4)
memory usage: 128.0+ bytes

#### Mengisi missing value

In [128]:
df_tipmiss['sex'] = df_tipmiss['sex'].fillna('missing')
df_tipmiss

   total_bill   tip      sex smoker  day    time  size
0       16.99  1.01   Female     No  Sun  Dinner     2
1         NaN  1.66     Male     No  Sun  Dinner     3
2       21.01  3.50     Male     No  Sun  Dinner     3
3       23.68   NaN     Male     No  Sun  Dinner     2
4       24.59  3.61  missing    NaN  Sun     NaN     4

In [124]:
#kenapa bracketnya 2?
df_tipmiss[['total_bill','tip']] = df_tipmiss[['total_bill','tip']].fillna(0)

In [125]:
#atau
df_tipmiss['total_bill'] = df_tipmiss['total_bill'].fillna(0)
df_tipmiss['tip'] = df_tipmiss['tip'].fillna(0)

In [126]:
df_tipmiss

   total_bill   tip      sex smoker  day    time  size
0       16.99  1.01   Female     No  Sun  Dinner     2
1        0.00  1.66     Male     No  Sun  Dinner     3
2       21.01  3.50     Male     No  Sun  Dinner     3
3       23.68  0.00     Male     No  Sun  Dinner     2
4       24.59  3.61  missing    NaN  Sun     NaN     4

### Fill missing values with a test statistic

In [130]:
mean_value = df_tipmiss['tip'].mean()
mean_value

2.445

In [131]:
df_tipmiss['tip'] = df_tipmiss['tip'].fillna(mean_value)

In [134]:
df_tipmiss

   total_bill    tip      sex smoker  day    time  size
0       16.99  1.010   Female     No  Sun  Dinner     2
1         NaN  1.660     Male     No  Sun  Dinner     3
2       21.01  3.500     Male     No  Sun  Dinner     3
3       23.68  2.445     Male     No  Sun  Dinner     2
4       24.59  3.610  missing    NaN  Sun     NaN     4

### Testing with asserts

In [147]:
goog = {'Date':['2017-02-09','2017-02-08','2017-02-07','2017-02-06','2017-02-03'],
       'Open':['831.729980', '830.530029', '', '820.919983',''],
       'High':['', '834.250000', '', '822.390015', '826.130005'],
       'Low':['826.500000', '825.109985', '823.289978', '', '820.130005'],
       'Close':['830.059998', '829.880005', '', '821.619995', '820.130005'],
       'Volume':['1192000.0', '1300600.0', '1664800.0', '', '1524400.0'],
       'Adj Close':['', '829.880005', '', '821.619995', '820.130005']}

In [146]:
google = pd.DataFrame(goog)